Revit 2024 API
IPerformanceAdviserRule.ExecuteElementCheck Method
 Invoked by performance advisor for each element to be checked.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
void ExecuteElementCheck(
	Document document,
	Element element
)
Visual Basic
Sub ExecuteElementCheck ( _
	document As Document, _
	element As Element _
)
Visual C++
void ExecuteElementCheck(
	Document^ document,
	Element^ element
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 Document for which performance problems are being checked.
element
Type: Autodesk.Revit.DB.Element
 The Element being checked for performance problems.
See Also
IPerformanceAdviserRule Interface
Autodesk.Revit.DB Namespace